TienVoCEK20/FreeRTOS/STM32_FreeRTOS_Task_Notify/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/

#include <string.h>
#include <stdlib.h>
#include <stdio.h>

#include "stm32f4xx.h"

#include "FreeRTOS.h"
#include "task.h"
			
TaskHandle_t xTaskHandle1 = NULL;
TaskHandle_t xTaskHandle2 = NULL;

#define TRUE 1
#define FALSE 0
#define HIGH 1
#define LOW 0
#define AVAILABLE TRUE
#define NOT_AVAILABLE FALSE

//Global variables
char usg_msg[250];
uint8_t ACCESS_KEY = AVAILABLE;
uint8_t button_pressed = 0;

//Task function prototypes
void vLED_Task_handler(void *param);
void vButton_Task_handler(void *param);

static void prvSetupHardware(void);
void printmsg(char *msg);
static void prvSetupUart(void);
static void LedSetup(void);
static void ButtonSetup(void);
void  rtos_delay(uint32_t delay_in_ms);


int main(void)
{
	//HSI ON, PLL OOF, HSE OFF, system clock = 16MHZ, cpu_clock =
	RCC_DeInit();

	//2. Update the SystemCoreClock variable
	SystemCoreClockUpdate();

	prvSetupHardware();

	xTaskCreate(vLED_Task_handler,"Led Handler",500,NULL,1,&xTaskHandle1);

	xTaskCreate(vButton_Task_handler,"Button Handler",500,NULL,1,&xTaskHandle2);

	vTaskStartScheduler();

	for(;;);
}

void vLED_Task_handler(void *param)
{
	while(1)
	{
		uint32_t current_notification_value=0;
		//lets wait until receiving any notification event from button_Taks

		if(xTaskNotifyWait(0,0,&current_notification_value,portMAX_DELAY) == pdTRUE)
		{
			//WE received the notification. LED toggle
			GPIO_ToggleBits(GPIOD,GPIO_Pin_12);
			sprintf(usg_msg,"Notification is received : Button press count : %ld \r\n",current_notification_value);
			printmsg(usg_msg);
		}

	}
}
void vButton_Task_handler(void *param)
{
	while(1)
	{
		if(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_0))
		{
			//If button is pressed
			//Compensate for the button debouncing
			rtos_delay(100);
			xTaskNotify(xTaskHandle1,0x0,eIncrement);
		}
	}
}
static void prvSetupHardware(void)
{
	LedSetup();
	ButtonSetup();
	prvSetupUart();
}
static void LedSetup(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD,ENABLE);
	GPIO_InitTypeDef Led_Handler;
	Led_Handler.GPIO_Pin = GPIO_Pin_12;
	Led_Handler.GPIO_OType = GPIO_OType_PP;
	Led_Handler.GPIO_PuPd = GPIO_PuPd_NOPULL;
	Led_Handler.GPIO_Mode = GPIO_Mode_OUT;
	Led_Handler.GPIO_Speed = GPIO_Low_Speed;
	GPIO_Init(GPIOD,&Led_Handler);
}
static void ButtonSetup(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);
	GPIO_InitTypeDef Button_Handler;
	Button_Handler.GPIO_Pin = GPIO_Pin_0;
	Button_Handler.GPIO_Mode = GPIO_Mode_IN;
	Button_Handler.GPIO_OType = GPIO_OType_PP;
	Button_Handler.GPIO_PuPd = GPIO_PuPd_NOPULL;
	Button_Handler.GPIO_Speed = GPIO_Low_Speed;
	GPIO_Init(GPIOA,&Button_Handler);
}
void printmsg(char *msg)
{
	for(uint32_t i=0; i < strlen(msg); i++)
	{
		while ( USART_GetFlagStatus(USART2,USART_FLAG_TXE) != SET);
		USART_SendData(USART2,msg[i]);
	}

	while ( USART_GetFlagStatus(USART2,USART_FLAG_TC) != SET);

}
static void prvSetupUart(void)
{
	GPIO_InitTypeDef gpio_uart_pins;
	USART_InitTypeDef uart2_init;

	//1. Enable the UART2  and GPIOA Peripheral clock
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);

	//PA2 is UART2_TX, PA3 is UART2_RX

	//2. Alternate function configuration of MCU pins to behave as UART2 TX and RX

	//zeroing each and every member element of the structure
	memset(&gpio_uart_pins,0,sizeof(gpio_uart_pins));

	gpio_uart_pins.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
	gpio_uart_pins.GPIO_Mode = GPIO_Mode_AF;
	gpio_uart_pins.GPIO_PuPd = GPIO_PuPd_UP;
	gpio_uart_pins.GPIO_OType= GPIO_OType_PP;
	gpio_uart_pins.GPIO_Speed = GPIO_High_Speed;
	GPIO_Init(GPIOA, &gpio_uart_pins);


	//3. AF mode settings for the pins
    GPIO_PinAFConfig(GPIOA,GPIO_PinSource2,GPIO_AF_USART2); //PA2
	GPIO_PinAFConfig(GPIOA,GPIO_PinSource3,GPIO_AF_USART2); //PA3

	//4. UART parameter initializations
	//zeroing each and every member element of the structure
	memset(&uart2_init,0,sizeof(uart2_init));

	uart2_init.USART_BaudRate = 115200;
	uart2_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	uart2_init.USART_Mode =  USART_Mode_Tx | USART_Mode_Rx;
	uart2_init.USART_Parity = USART_Parity_No;
	uart2_init.USART_StopBits = USART_StopBits_1;
	uart2_init.USART_WordLength = USART_WordLength_8b;
	USART_Init(USART2,&uart2_init);


	//5. Enable the UART2 peripheral
	USART_Cmd(USART2,ENABLE);

}
void  rtos_delay(uint32_t delay_in_ms)
{
	uint32_t current_tick_count = xTaskGetTickCount();

	uint32_t delay_in_tick = (delay_in_ms * configTICK_RATE_HZ) / 1000;

	while(xTaskGetTickCount() < (current_tick_count + delay_in_tick));
}
